{
    "Mojito": "Mescolare le foglie di menta con lo zucchero e il succo di lime. Aggiungere una spruzzata di acqua gassata o soda e riempire il bicchiere con ghiaccio tritato. Versare il rum e completare con l'acqua gassata. Guarnire e servire con una cannuccia",
    "gin-&-tonic": "Versare il gin e l'acqua tonica in un bicchiere highball su cubetti di ghiaccio. Aggiungere lo spicchio di lime e servire",
    "Bloody-mary": "Versare tutti gli ingredienti in un bicchiere 'highball', Mescolando delicatamente e guarnire",
    "cosmopolitan": "Aggiungere tutti gli ingredienti nello shaker riempito di ghiaccio. Agitare bene e filtrare due volte in un bicchiere da cocktail grande. Guarnire con una rondella di lime",
    "margarita": "Strofinare il bordo del bicchiere con la fetta di lime per far aderire il sale. Fare attenzione a inumidire solo il bordo esterno in modo che il sale rimanga solo all'esterno. Le labbra devono sentire il sale che non si deve mescolare al cocktail. Agitare gli altri ingredienti col ghiaccio, quindi versare con cura nel bicchiere",
    "frozen-strawberry-daiquiri": "Versare tutti gli ingredienti nello shaker insieme a cubetti di ghiaccio. Agitare bene. Filtrare in un bicchiere da cocktail freddo",
    "amaretto-sour": "Agitare e filtrare. Guarnire con una ciliegia e una fetta d'arancia",
    "moscow-mule": "Unire vodka e ginger beer in un bicchiere 'highball' pieno di ghiaccio. Aggiungere il succo di lime. Mescolare delicatamente. Guarnire",
    "pina-colada": "Mescolare con ghiaccio tritato in uno shaker. Versare in un bicchiere freddo, guarnire e servire",
    "whiskey-sour": "Shakerare con ghiaccio. Versare in un bicchiere freddo, guarnire e servire". Se servito 'on the rocks', filtrare gli ingredienti in un bicchiere 'old-fashioned' riempito di ghiaccio",
    "pink-lady": "Agitare con ghiaccio. Filtrare in un bicchiere ghiacciato e servire",
    "gin-sour": "Unire gli ingredienti in uno shaker riempito per metà con cubetti di ghiaccio. Agitare bene. Filtrare in un bicchiere 'sour' e guarnire con una fetta d'arancia",
    "dry-martini": "Liscio: versare tutti gli ingredienti in un bicchiere con i cubetti di ghiaccio. Mescolare bene. Filtrare in un bicchiere freddo da cocktail martini . Guarnire con un'oliva",
    "Hot-shot": "Versare il Galliano in un bicchiere da shot. Aiutandosi col dorso di un cucchiaio, versare con cura il caffè sul liquore. Infine completare il tutto versando lentamente la panna montata, usando sempre il retro del cucchiaio.",
    "frozen-margarita": "Unire tutti gli ingredienti in un frullatore elettrico e frullare a bassa velocità per cinque secondi, quindi frullare ad alta velocità fino ad ottenere un composto solido. Versare il contenuto in un bicchiere 'highball', guarnire con una fetta di lime e servire",
    "negroni": "Mescolare direttamente nel bicchiere con ghiaccio, guarnire e servire",
    "Daiquiri": "Versare tutti gli ingredienti nello shaker con cubetti di ghiaccio. Agitare bene. Filtrare in un bicchiere freddo da cocktail",
    "cocktail dopo cena": "Agitare tutti gli ingredienti tranne lo spicchio di lime con ghiaccio e filtrare in un bicchiere da cocktail. Aggiungere lo spicchio di lime e servire",
    "manhattan": "Mescolare con ghiaccio, filtrare in un bicchiere ghiacciato, guarnire con ciliegia e scorza d'arancia e servitr",
    "alabama-slammer": "Versare tutti gli ingredienti tranne il succo di limone sul ghiaccio in un bicchiere 'highball'. Mescolare, aggiungere una goccia di succo di limone e servire",
    "irish-coffee": "Scaldare il caffè, il whisky e lo zucchero senza bollire. Versare nel bicchiere e completare con la panna; servire caldo",
  
  "black-russian": "Pour the ingredients into an old fashioned glass filled with ice cubes. Stir gently.",
    "blackthorn": "Stir sloe gin and vermouth with ice and strain into a cocktail glass. Add the twist of lemon peel and serve.",
    "blue-lagoon": "Pour vodka and curacao over ice in a highball glass. Fill with Sprite, top with the cherry, and serve.",
    "blue-margarita": "Rub rim of cocktail glass with lime juice. Dip rim in coarse salt. Shake tequila, blue curacao, and lime juice with ice, strain into the salt-rimmed glass, and serve.",
    "alexander": "Shake all ingredients with ice and strain contents into a cocktail glass. Sprinkle nutmeg on top and serve.",
    "brandy-alexander": "Shake all ingredients (except nutmeg) with ice and strain contents into a cocktail glass. Sprinkle nutmeg on top and serve.",
    "alfie-cocktail": "Combine and shake all ingredients with ice, strain into a cocktail glass, and serve.",
    "algonquin": "Combine and shake all ingredients with ice, strain contents into a cocktail glass, and serve.",
    "allegheny": "Shake all ingredients (except lemon peel) with ice and strain into a cocktail glass. Top with the twist of lemon peel and serve.",
    "almeria": "In a shaker half-filled with ice cubes, combine all of the ingredients. Shake well. Strain into a cocktail glass.",
    "almond-joy": "Shake all ingredients with ice, strain into a cocktail glass, and serve.",
    "amaretto-rose": "Pour amaretto and lime juice over ice in a collins glass. Fill with soda water and serve.",
    "balmoral": "In a mixing glass half-filled with ice cubes, combine all of the ingredients. Stir well. Strain into a cocktail glass.",
    "bermuda-highball": "Pour brandy, gin, and dry vermouth into a highball glass over ice cubes. Fill with carbonated water and stir. Add the twist of lemon and serve. (Ginger ale may be substituted for soda water, if preferred.",
    "bluebird": "In a mixing glass half-filled with crushed ice, combine the gin, triple sec, Curacao, and bitters. Stir well. Strain into a cocktail glass and garnish with the lemon twist and the cherry.",
    "boxcar": "In a shaker half-filled with ice cubes, combine all of the ingredients. Shake well. Strain into a sour glass.",
    "california-lemonade": "Shake all ingredients (except carbonated water) with ice and strain into a collins glass over shaved ice. Fill with carbonated water and stir. Decorate with slices of orange and lemon. Add the cherry and serve with a straw.",
    "casino-royale": "In a shaker half-filled with ice cubes, combine all of the ingredients. Shake well. Strain into a sour glass.",
    "champagne-cocktail": "Add dash of Angostura bitter onto sugar cube and drop it into champagne flute. Add cognac followed by gently pouring chilled champagne. Garnish with orange slice and maraschino cherry.",
    "chocolate-black-russian": "Combine all ingredients in an electric blender and blend at a low speed for a short length of time. Pour into a chilled champagne flute and serve.",
    "city-slicker": "In a shaker half-filled with ice cubes, combine all of the ingredients. Shake well. Strain into a cocktail glass.",
    "cuba-libre": "Build all ingredients in a Collins glass filled with ice. Garnish with lime wedge.",
    "foxy-lady": "Shake all ingredients with ice, strain into a chilled cocktail glass, and serve.",
    "harvey-wallbanger": "Stir the vodka and orange juice with ice in the glass, then float the Galliano on top. Garnish and serve.",
    "havana-cocktail": "In a shaker half-filled with ice cubes, combine all of the ingredients. Shake well. Strain into a cocktail glass.",
    "jack-rose-cocktail": "Shake all ingredients with ice, strain into a cocktail glass, and serve.",
    "kamikaze": "Shake all ingredients together with ice. Strain into glass, garnish and serve.",
    "mai-tai": "Shake light rum, orange liqueur, orgeat syrup, and Sweet & Sour mix with ice. Strain into a glass and add dark rum. Finish with some garnish and serve with a straw.",
    "screwdriver": "Mix in a highball glass with ice. Garnish and serve.",
    "sloe-gin-cocktail": "Stir all ingredients with ice, strain into a cocktail glass, and serve.",
    "stone-sour": "Shake all ingredients with ice, strain into a chilled whiskey sour glass, and serve.",
    "tequila-sour": "Shake tequila, juice of lemon, and powdered sugar with ice and strain into a whiskey sour glass. Add the half-slice of lemon, top with the cherry, and serve.",
    "tom-collins": "In a shaker half-filled with ice cubes, combine the gin, lemon juice, and sugar. Shake well. Strain into a collins glass alomst filled with ice cubes. Add the club soda. Stir and garnish with the cherry and the orange slice.",
    "valencia-cocktail": "Shake all ingredients with ice, strain into a cocktail glass, and serve.",
    "vermouth-cassis": "Stir vermouth and creme de cassis in a highball glass with ice cubes. Fill with carbonated water, stir again, and serve.",
    "sex-on-the-beach": "Build all ingredients in a highball glass filled with ice. Garnish with orange slice.",
    "tequila-sunrise": "Pour the tequila and orange juice into glass over ice. Add the grenadine, which will sink to the bottom. Stir gently to create the sunrise effect. Garnish and serve.",
    "mimosa": "Ensure both ingredients are well chilled, then mix into the glass. Serve cold.",
    "dark-and-stormy": "Fill highball glass (image shows a lowball glass) with ice, fill almost to the top with ginger beer, softly pour the dark rum on top to make it float. Garnish with lime. Serve with straw.",
    "happy-skipper": "Pour Spiced Rum over ice, fill glass to top with Ginger Ale. Garnish with lime.",
    "brave-bull-shooter": "Pour Tabasco into bottom of shot glass and fill with tequila.",
    "at&t": "Pour Vodka and Gin over ice, add Tonic and Stir",
    "belgian-blue": "Just pour all ingredients in the glass and stir.",
    "grand-blue": "Serve in an old fashioned glass.",
    "americano": "Pour the Campari and vermouth over ice into glass, add a splash of soda water and garnish with half orange slice.",
    "campari-beer": "Use a beer mug. Add Campari first. Fill with beer.",
    "moranguito": "First you put the absinthe, then put tequila, then put the Granadine syrup.",
    "swedish-blueberry-shot": "Pour Licor 43 into a shot glass. Using the backside of a spoon, carefully pour blueberry juice on top of the liqueur. Finally to top it off, use the backside of the spoon again to slowly pour the whipped cream on top.",
    "pink-panther": "Pour all ingredients in a shaker with ice. Shake well. Strain into a glass.",
    "arizona-antifreeze": "Pour all ingredients into shot glass and slam.",
    "gt-blue": "Pour the gin, blue curacao and tonic into a highball glass over ice cubes. Garnish with a lemon slice and serve.",
    "melon-sour": "Pour all ingredients into shaker with ice cubes. Shake well. Strain in a rocks glass filled with ice cubes.",
    "zorbatini": "Prepare like a Martini. Garnish with a green olive.",
    "ruby-tuesday": "Pour gin and cranberry into a highball filled with ice cubes. Add grenadine and stir.",
    "espresso-martini": "Pour ingredients into shaker filled with ice, shake vigorously, and strain into chilled martini glass",
    "english-highball": "Pour brandy, gin, and sweet vermouth into a highball glass over ice cubes. Fill with soda water. Add the twist of lemon peel, stir, and serve. (Ginger ale may be substituted for carbonated water, if preferred.)",
    "english-rose-cocktail": "Rub rim of cocktail glass with lemon juice and dip rim of glass in powdered sugar. Shake all ingredients (except cherry) with ice and strain into sugar-rimmed glass. Top with the cherry and serve.",
    "imperial-cocktail": "Shake with ice and strain into cocktail glass.",
    "irish-spring": "Pour all ingredients into a collins glass over ice cubes. Garnish with the slice of orange, add the cherry on top, and serve.",
    "kiwi-martini": "The kiwi martini is a very fun vodka cocktail and it is one of the best drinks that makes use of fresh fruit. Though there are a few recipes floating around, this is one of the easiest and it is an absolutely delightful green martini to drink. For this recipe, you simply muddle slices of kiwi with simple syrup, then shake it with vodka. It is a drink that anyone can mix up in minutes and a perfect cocktail to show off your favorite vodka.",
    "lazy-coconut-paloma": "Mix the coconut liqueur (preferably tequila) with the grapefruit juice and top with soda water. Garnish with a large grapefruit slice against the inside of the glass.",
    "lemon-elderflower-spritzer": "Pour all ingredients over ice, stir and enjoy!",
    "orange-crush": "Add all ingredients to tumbler-Pour as shot",
    "mountain-bramble": "Muddle blackberries in a tumbler glass. Mix the Gin, lemon juice and sugar syrup in a shaker and strain over chopped ice. Top with Soda water and garnish with more blackberries and some mint",
    "gin-swizzle": "In a shaker half-filled with ice cubes, combine the lime juice, sugar, gin, and bitters. Shake well. Almost fill a colling glass with ice cubes. Stir until the glass is frosted. Strain the mixture in the shaker into the glass and add the club soda.",
    "cocktail-horses-neck": "Wash and brush an organic, untreated lemon, then cut a spiral of lemon peel, using a citrus peel. If it is too large, cut it with a sharp knife. Put some ice in a tall tumbler glass, place the lemon peel inside and pour the cognac, add the ginger beer and let 2-3 drops of Angostura fall into it. Easy to do, but once you try it you will love it.",
    "vodka-tonic": "Wash and cut 1 wedge and 1 slice of lime or lemon. Fill a tumbler with fresh ice. Pour the desired dose of vodka and top up with the tonic. Squeeze the lime wedge into the glass and decorate with the slice. That is all, very simple: it is just the recipe for happiness!",
    "bombay-cassis": "Add the Gin, Crème de Cassis and lime juice to a balloon glass and swirl well to mix. Fill the glass with good quality cubed ice. Top up with chilled and freshly opened Fever-Tree Ginger Beer. Gently stir to combine, top with a gently squeezed lime wedge and finish with a fresh ginger slice.",
    "pegu-club": "Shake, strain, up, cocktail glass",
    "greyhound": "Add the vodka to a Collins glass filled with ice. Top with grapefruit juice and stir.",
    "gimlet": "Add all the ingredients to a shaker and fill with ice. Shake, and strain into a chilled cocktail glass or an Old Fashioned glass filled with fresh ice. Garnish with a lime wheel.",
    "a-furlong-too-late": "Pour the rum and ginger beer into a highball glass almost filled with ice cubes. Stir well. Garnish with the lemon twist.",
    "spritz-veneziano": "Build into glass over ice, garnish and serve.",
    "amaretto-fizz": "Mix Amaretto, orange juice and sparkling wine in a jug. Add a strip orange zest to each glass, if you like.",
    "aperol-spritz": "Put a couple of cubes of ice into 2 glasses and add Aperol. Divide the prosecco between the glasses and then top up with soda, if you like.",
    "the-philosopher": "Add all the spirits in a shaker (best to use Hendricks gin) as well as the orange bitters and lemon juice. Strain into a Margarita glass, top with Prosecco.",
    "bounty-hunter": "Add the spirits into a shaker as well as the pineapple juice, strain into a Margarita glass. Top with Prosecco and garnish with Blueberries.",
    "blueberry-mojito": "Muddle the blueberries with the other ingredients and serve in a highball glass. Garnish with mint and a half slice of lime.",
    "autumn-garibaldi": "Pour all ingredients into a glass over ice and stir with a bar spoon. Garnish with some orange slices.",
    "simple-long-island-ice-tea": "Mix all contents in a highball glass and sitr gently. Add dash of Coca-Cola for the coloring and garnish with lemon or lime twist.",
    "white-russian": "Pour vodka and coffee liqueur over ice cubes in an old-fashioned glass. Fill with light cream and serve.",
    "mezcal-old-fashioned": "Put ingredients into old-fashioned glass filled with ice and stir.",
    "old-fashioned": "Place sugar cube in old fashioned glass and saturate with bitters, add a dash of plain water. Muddle until dissolved. Fill the glass with ice cubes and add whiskey. Garnish with orange twist, and a cocktail cherry",
    "sidecar": "Pour all ingredients into cocktail shaker filled with ice. Shake well and strain into cocktail glass.",
    "french-75": "Combine gin, sugar, and lemon juice in a cocktail shaker filled with ice. Shake vigorously and strain into a chilled champagne glass. Top up with Champagne. Stir gently.",
    "mint-julep": "In a highball glass gently muddle the mint, sugar and water. Fill the glass with cracked ice, add Bourbon and stir well until the glass is well frosted. Garnish with a mint sprig.",
    "pisco-sour": "Vigorously shake and strain contents in a cocktail shaker with ice cubes, then pour into glass and garnish with bitters.",
    "aquafaba-gin-fizz": "Add the gin, lime juice, Aquafaba and sugar syrup to a cocktail shaker filled with ice. Shake until cold to touch. Strain the shaker into a rocks glass filled with ice and top with soda water. Garnish with a lime wedge.",
    "bellini": "Pour peach schnapps into chilled flute, add champange. Stir gently.",
    "mango-mojito": "Blend lime juice with the mango to give a smooth purée. Put 2 pieces of lime in a highball glass and add 1 teaspoon of caster sugar and 5-6 mint leaves. Squish everything together with a muddler or the end of a rolling pin to release all the flavours from the lime and mint. Add the mango purée, 30ml white rum and a handful of crushed ice, stirring well to mix everything together. Top up with soda water to serve and garnish with extra mint, if you like.",
    "pornstar-martini": "Straight: Pour all ingredients into mixing glass with ice cubes. Shake well. Strain in chilled martini cocktail glass. Cut passion fruit in half and use as garnish.",
    "pink-moon": "Slowly shake in a shaker with ice, strain into a square whiskey glass. Top with fresh ice. Add the blackberries to garnish. Add flowers and a green leaf for a special look!",
    "simple-syrup": "Dissolve the sugar in boiling water. \nLet cool. \nStore in the fridge. Lasts about a month.",
    "sweet-and-sour": "Mix simple syrup with lemon and lime juice. \nPour into a bottle and store in the fridge. Lasts about a month.",
    "afterglow": "Mix \nServe over ice",
    "alice-cocktail": "Shake well, strain into a large cocktail glass.",
    "apple-karate": "Place all ingredients in the blender jar - cover and whiz on medium speed until well blended. Pour in one tall, 2 medium or 3 small glasses and drink up.",
    "orangeade": "Place some ice cubes in a large tumbler or highball glass, add lemon juice, orange juice, sugar syrup, and stir well. \nTop up with cold soda water, serve with a drinking straw.",
    "banana-milk-shake": "Blend very well, preferably in a household mixer. \nServe in a wine glass, garnish with whipped cream and a piece of banana.",
    "absolut-limousine": "Fill Absolut into a glass. Add Lime juice. Add Ice and lime wedges.",
    "zizi-coin-coin": "Pour Cointreau on ice, add fresh lemon (or lime) juice, stir gently, and finally add slices of lemon/lime in glass",
    "cream-soda": "Pour 1oz of Spiced Rum into a highball glass with ice. Fill with Ginger Ale.",
    "caipirinha": "Place lime juice and sugar into old fashioned glass. Fill the glass with ice and add the Cachaça.",
    "elderflower-caipirinha": "Fill the glass with crushed ice and add Cachaça, lime juice and elderflower cordial. Stir well and top with some more crushed ice. Garnish with lime and enjoy!",
    "california-root-beer": "Put Kahlua and Galliano in highball glass fill with Coke",
    "sangria": "Mix all together in a pitcher and refrigerate. Add cloves and cinnamon sticks to taste. Serve in wine glasses.",
    "white-sangria": "Chop the Lemon, Lime and other fruits into large chunks.\nFill the Pitcher with the white wine and mix in the Apple Brandy.\nTop to taste with soda water.",
    "french-martini": "Pour all ingredients into shaker with ice cubes.\nShake well and strain into a chilled cocktail glass.\nSqueeze oil from lemon peel onto the drink",
    "russian-spring-punch": "Pour the ingredients into an highball glass with ice",
    "b-52": "Layer ingredients into a shot glass. Start with coffee liqueur, continue with Baileys and lastly the Grand Marnier",
    "barracuda": "Shake pour ingredients with ice. Strain into glass, top with Sparkling wine.",
    "bramble": "Fill glass with crushed ice. Build gin, lemon juice and simple syrup over. Stir, and then pour blackberry liqueur over in a circular fashion to create marbling effect. Garnish with two blackberries and lemon slice.",
    "vampiro": "Vampiros may be made in a tall glass or an old fashioned glass.\nBartenders may first \"rim\" the glass with Kosher Salt, which is done by placing a layer of Kosher Salt on a chopping board, moistening the glass' rim with lime juice or water, and then placing the upside down glass rim onto the Kosher Salt, so that the salt sticks to the moistened rim.\nThe second step is to fill half the glass with ice and add one or two shooter glasses full of high quality Tequila.\nThe next stage is to add the flavouring elements. This is done by squeezing a fresh lime into the glass, adding a few grains of salt, adding citrus-flavoured soda pop, until the glass is 4/5 full, and then adding spicy Viuda de Sanchez (or orange juice, lime juice and pico de gallo).\nThe final step is to stir the ingredients so that the flavours are properly blended.",
    "yellow-bird": "Shake and strain into a chilled cocktail glass",
    "tommys-margarita": "Shake and strain into a chilled cocktail glass",
    "hemingway-special": "Pour all ingredients into a shaker with ice. Shake.",
    "gin-fizz": "Shake all ingredients with ice cubes, except soda water. Pour into glass. Top with soda water.",
    "last-word": "Shake with ice and strain into a cocktail glass.",
    "new-york-sour": "Shake blended whiskey, juice of lemon, and simple syrup with ice and strain into a whiskey glass. Float claret on top. Decorate with the half-slice of lemon and the cherry and serve.",
    "paradise": "Shake together over ice. Strain into cocktail glass and serve chilled.",
    "porto-flip": "Shake ingredients together in a mixer with ice. Strain into glass, garnish and serve.",
    "sea-breeze": "Build all ingredients in a highball glass filled with ice. Garnish with lime wedge.",
    "tipperary": "Stir over ice. Strain into chilled glass. Cut a wide swath of orange peel, and express the orange oils over the drink. Discard orange twist.",
    "bees-knees": "Stir honey with lemon and orange juices until it dissolves, add gin and shake with ice. Strain into a chilled cocktail glass.",
    "boulevardier": "Stir with ice, strain, garnish and serve.",
    "casino": "Pour all ingredients into shaker with ice cubes. Shake well. Strain into chilled cocktail glass. Garnish with a lemon twist and a maraschino cherry. Serve without a straw.",
    "paper-plane": "Pour all ingredients into a cocktail shaker, shake with ice, strain into cocktail glass.",
    "long-island-ice-tea": "Add all ingredients into a highball glass filled with ice.\nStir gently."
}
